Repository: punundev/m-2fa
Catalog: lib/l10n/app_*.arb
Languages: km

# appName
source: Nun Auth
km: Nun ការផ្ទៀងផ្ទាត់

# homeTitle
source: Home
km: ទំព័រដើម

# profileTitle
source: Profile
km: ប្រវត្តិរូប

# settingsTitle
source: Settings
km: ការកំណត់

# logoutTitle
source: Logout
km: ចាកចេញ

# userNameDefault
source: User Name
km: ឈ្មោះអ្នកប្រើ

# emailDefault
source: No email available
km: មិនមានអ៊ីមែល

source: Edit Profile
km: កែប្រែប្រវត្តិរូប

source: Security & Account
km: សុវត្ថិភាព និង គណនី

# changePin
source: Change PIN Code
km: ផ្លាស់ប្តូរ PIN

# changePinSubtitle
source: Update your quick access 4-digit PIN.
km: ធ្វើបច្ចុប្បន្នភាព PIN ចូលរហ័ស ៤ ខ្ទង់។

source: Change Password
km: ផ្លាស់ប្តូរពាក្យសម្ងាត់

# editProfileTitle
source: Edit Profile
km: កែប្រែប្រវត្តិរូប

# displayNameLabel
source: Display Name (Full Name)
km: ឈ្មោះបង្ហាញ (ឈ្មោះពេញ)

source: Save Profile
km: រក្សាទុកប្រវត្តិរូប

source: Uploading avatar...
km: កំពុងផ្ទុករូបតំណាង...

# profileSaveSuccess
source: Profile saved successfully and synced!
km: បានរក្សាទុក និង ធ្វើសមកាលកម្មប្រវត្តិរូបដោយជោគជ័យ!

# profileSaveFailed
source: Failed to save profile:
km: មិនអាចរក្សាទុកប្រវត្តិរូបបាន៖

# changePasswordTitle
source: Change Password
km: ផ្លាស់ប្តូរពាក្យសម្ងាត់

# updateCredentialsText
source: Update your login credentials.
km: ធ្វើបច្ចុប្បន្នភាពព័ត៌មានចូលប្រើប្រាស់។

# currentPasswordLabel
source: Current Password
km: ពាក្យសម្ងាត់បច្ចុប្បន្ន

# newPasswordLabel
source: New Password
km: ពាក្យសម្ងាត់ថ្មី

# confirmNewPasswordLabel
source: Confirm New Password
km: បញ្ជាក់ពាក្យសម្ងាត់ថ្មី

# enterCurrentPassword
source: Enter your current password.
km: សូមបញ្ចូលពាក្យសម្ងាត់បច្ចុប្បន្ន។

# enterNewPassword
source: Enter a new password.
km: សូមបញ្ចូលពាក្យសម្ងាត់ថ្មី។

# confirmNewPassword
source: Confirm your new password.
km: សូមបញ្ជាក់ពាក្យសម្ងាត់ថ្មី។

source: Passwords do not match.
km: ពាក្យសម្ងាត់មិនត្រូវគ្នា។

# passwordMismatch
source: New passwords do not match.
km: ពាក្យសម្ងាត់ថ្មីមិនត្រូវគ្នា។

source: Save New Password
km: រក្សាទុកពាក្យសម្ងាត់ថ្មី

# passwordUpdateSuccess
source: Password updated successfully!
km: បានធ្វើបច្ចុប្បន្នភាពពាក្យសម្ងាត់ដោយជោគជ័យ!

# userEmailNotFound
source: User email not found. Please re-login.
km: រកមិនឃើញអ៊ីមែលអ្នកប្រើ។ សូមចូលប្រើឡើងវិញ។

source: Invalid current password.
km: ពាក្យសម្ងាត់បច្ចុប្បន្នមិនត្រឹមត្រូវ។

# updatePasswordFailed
source: Failed to update password.
km: មិនអាចធ្វើបច្ចុប្បន្នភាពពាក្យសម្ងាត់បាន។

source: Theme Mode
km: របៀបពន្លឺ

source: Light Mode
km: ពន្លឺថ្ងៃ

source: Dark Mode
km: ពន្លឺងងឹត

# systemMode
source: System Default
km: តាមប្រព័ន្ធ

# primaryColor
source: Primary App Color
km: ពណ៌ចម្បងកម្មវិធី

source: Language
km: ភាសា

# languageName
source: English
km: ភាសាខ្មែរ
